; domain
(define (domain knights-and-pawns)
    (:requirements :typing :negative-preconditions :equality :disjunctive-preconditions)
    (:types
        figure - object
        location - object
        white - figure
        ;black - figure
        pawn_w knight_w king_w rook_w bishop_w - white
        ;knight_b - black

    )
    (:predicates
        (at ?figure - figure ?file ?rank - location)
        (diff_by_Zero ?file ?rank - location)
        (diff_by_One ?file ?rank - location)
        (diff_by_Two ?file ?rank - location)
        (diff_by_Three ?file ?rank - location)
        (diff_by_Four ?file ?rank - location)
        (diff_by_Five ?file ?rank - location)
        (diff_by_Six ?file ?rank - location)
        (diff_by_Seven ?file ?rank - location)
        (diff_by_Eight ?file ?rank - location)
        (diff_by_N ?file ?rank - location)
        (plusOne_white ?file ?rank - location)
        (plusOne_black ?file ?rank - location)
        (pawn_double_white ?from_file ?to_file ?from_rank ?to_rank - location)
        (pawn_double_black ?from_file ?to_file ?from_rank ?to_rank - location)
    )

    (:action bishop_move
        :parameters (?bishop - bishop_w ?from_file ?to_file ?from_rank ?to_rank - location)
        :precondition (and (at ?bishop ?from_file ?from_rank)
                           (or
							   (and (diff_by_One ?from_file ?to_file) ;file +/-1
							        (diff_by_One ?from_rank ?to_rank) ;rank +/-1
							   )
							   (and (diff_by_Two ?from_file ?to_file) ;file +/-2
							        (diff_by_Two ?from_rank ?to_rank) ;rank +/-2
							   )
							   (and (diff_by_Three ?from_file ?to_file) ;file +/-3
							        (diff_by_Three ?from_rank ?to_rank) ;rank +/-3
							   )
							   (and (diff_by_Four ?from_file ?to_file) ;file +/-4
							        (diff_by_Four ?from_rank ?to_rank) ;rank +/-4
							   )
							   (and (diff_by_Five ?from_file ?to_file) ;file +/-5
							        (diff_by_Five ?from_rank ?to_rank) ;rank +/-5
							   )
                           )
                           (not (at ?bishop ?to_file ?to_rank))
                       )
        :effect (and (not (at ?bishop ?from_file ?from_rank))
                     (at ?bishop ?to_file ?to_rank)
                )
    )

    (:action rook_move_vetical
        :parameters (?rook - rook_w ?from_file ?to_file ?from_rank ?to_rank - location)
        :precondition (and (at ?rook ?from_file ?from_rank)
                           (diff_by_Zero ?from_file ?to_file) ; file +/-0
                           (diff_by_N ?from_rank ?to_rank) ; rank +/-n
                           
                           (not (at ?rook ?to_file ?to_rank))
                       )
        :effect (and (not (at ?rook ?from_file ?from_rank))
                     (at ?rook ?to_file ?to_rank)
                )
    )

    (:action rook_move_horizontal
        :parameters (?rook - rook_w ?from_file ?to_file ?from_rank ?to_rank - location)
        :precondition (and (at ?rook ?from_file ?from_rank)
                           (diff_by_Zero ?from_rank ?to_rank) ; file +/-0
                           (diff_by_N ?from_file ?to_file) ; rank +/-n
                           
                           (not (at ?rook ?to_file ?to_rank))
                       )
        :effect (and (not (at ?rook ?from_file ?from_rank))
                     (at ?rook ?to_file ?to_rank)
                )
    )
    
    (:action pawn_move_double_white
        :parameters (?pawn - pawn_w ?from_file ?to_file ?from_rank ?to_rank - location)
        :precondition (and (at ?pawn ?from_file ?from_rank)
                           (pawn_double_white ?from_file ?to_file ?from_rank ?to_rank)
                           (not (at ?pawn ?to_file ?to_rank))
                      )
        :effect (and (not (at ?pawn ?from_file ?from_rank))
                     (at ?pawn ?to_file ?to_rank)
                )
    )

    (:action king_move
        :parameters (?king - king_w ?from_file ?to_file ?from_rank ?to_rank - location)
        :precondition (and (at ?king ?from_file ?from_rank)
                           (diff_by_One ?from_file ?to_file) ; file +/-1
                           (diff_by_One ?from_rank ?to_rank) ; rank +/-1
                           (not (at ?king ?to_file ?to_rank))
                       )
        :effect (and (not (at ?king ?from_file ?from_rank))
                     (at ?king ?to_file ?to_rank)
                )
    )

    (:action pawn_move_single_white
        :parameters (?pawn - pawn_w ?from_file ?to_file ?from_rank ?to_rank - location)
        :precondition (and (at ?pawn ?from_file ?from_rank)
                           (diff_by_Zero ?from_file ?to_file) ; file +/- 0
                           (plusOne_white ?from_rank ?to_rank) ; rank +1
                      )
        :effect (and (not (at ?pawn ?from_file ?from_rank))
                     (at ?pawn ?to_file ?to_rank)
                )
    )

    (:action knight_move_2file_1rank
        :parameters (?knight1 ?knight2 - knight_w ?from_file ?to_file ?from_rank ?to_rank - location)
        :precondition (and (at ?knight1 ?from_file ?from_rank)
                           (diff_by_Two ?from_file ?to_file) ; file +/- 2
                           (diff_by_One ?from_rank ?to_rank) ; rank +/- 1
                           (not (at ?knight2 ?to_file ?to_rank))
                           (not (at ?knight1 ?to_file ?to_rank))
                           (not (= ?knight1 ?knight2))
                      )
        :effect (and (not (at ?knight1 ?from_file ?from_rank))
                     (at ?knight1 ?to_file ?to_rank)
                )
    )
    (:action knight_move_2rank_1file
        :parameters (?knight1 ?knight2 - knight_w ?from_file ?to_file ?from_rank ?to_rank - location)
        :precondition (and (at ?knight1 ?from_file ?from_rank)
                           (diff_by_Two ?from_rank ?to_rank) ; rank +/- 2
                           (diff_by_One ?from_file ?to_file) ; file +/- 1
                           (not (at ?knight2 ?to_file ?to_rank))
                           (not (at ?knight1 ?to_file ?to_rank))
                           (not (= ?knight1 ?knight2))
                           )
        :effect (and (not (at ?knight1 ?from_file ?from_rank))
                     (at ?knight1 ?to_file ?to_rank)
                )
    )
)

; problem
(define (problem knights-and-pawns-problem)
    (:domain knights-and-pawns)
    (:objects
        n1 n2 n3 n4 n5 - location
        knight_w1 knight_w2 - knight_w
        ;knight_b1 knight_b2 - knight_b
        pawn_w1 pawn_w2 pawn_w3 pawn_w4 pawn_w5 - pawn_w
        king_w1 - king_w
        rook_w1 rook_w2 - rook_w
        w_bishop_w1 b_bishop_w1 - bishop_w
        ;pawn_b1 pawn_b2 pawn_b3 pawn_b4 pawn_b5 - pawn black
    )
    (:init
        ;Initial position of the Knight piece (upper left corner) => (n1 n8) = A8  // (at pawn_w1 n1 n2) = A2
		(at pawn_w1 n1 n2)
		(at pawn_w2 n2 n2)
		(at pawn_w3 n3 n2)
		(at pawn_w4 n4 n2)
		(at pawn_w5 n5 n2)
		(at rook_w1 n1 n1)
		(at knight_w1 n2 n1)
		(at king_w1 n3 n1)
		(at knight_w2 n4 n1)
		(at w_bishop_w1 n5 n1)

		;Difference by Zero:
		(diff_by_Zero n1 n1)
		(diff_by_Zero n2 n2)
		(diff_by_Zero n3 n3)
		(diff_by_Zero n4 n4)
		(diff_by_Zero n5 n5)

		;Difference by One:
		(diff_by_One n1 n2)
		(diff_by_One n2 n1)
		(diff_by_One n2 n3)
		(diff_by_One n3 n2)
		(diff_by_One n3 n4)
		(diff_by_One n4 n3)
		(diff_by_One n4 n5)
		(diff_by_One n5 n4)

		;Difference by Two:
		(diff_by_Two n1 n3)
		(diff_by_Two n2 n4)
		(diff_by_Two n3 n1)
		(diff_by_Two n3 n5)
		(diff_by_Two n4 n2)
		(diff_by_Two n5 n3)

		;Difference by Three:
		(diff_by_Three n1 n4)
		(diff_by_Three n2 n5)
		(diff_by_Three n4 n1)
		(diff_by_Three n5 n2)

		;Difference by Four:
		(diff_by_Four n1 n5)
		(diff_by_Four n5 n1)

		;Difference by Five:

		;Difference by Six:

		;Difference by Seven:

		;Diff by Zero:
		(diff_by_N n1 n1)
		(diff_by_N n2 n2)
		(diff_by_N n3 n3)
		(diff_by_N n4 n4)
		(diff_by_N n5 n5)

		;Diff by One:
		(diff_by_N n1 n2)
		(diff_by_N n2 n1)
		(diff_by_N n2 n3)
		(diff_by_N n3 n2)
		(diff_by_N n3 n4)
		(diff_by_N n4 n3)
		(diff_by_N n4 n5)
		(diff_by_N n5 n4)

		;Diff by Two:
		(diff_by_N n1 n3)
		(diff_by_N n2 n4)
		(diff_by_N n3 n1)
		(diff_by_N n3 n5)
		(diff_by_N n4 n2)
		(diff_by_N n5 n3)

		;Diff by Three:
		(diff_by_N n1 n4)
		(diff_by_N n2 n5)
		(diff_by_N n4 n1)
		(diff_by_N n5 n2)

		;Diff by Four:
		(diff_by_N n1 n5)
		(diff_by_N n5 n1)

		;Pawn double moves for white:
		(pawn_double_white n1 n1 n2 n4)
		(pawn_double_white n2 n2 n2 n4)
		(pawn_double_white n3 n3 n2 n4)
		(pawn_double_white n4 n4 n2 n4)
		(pawn_double_white n5 n5 n2 n4)

		;Pawn double moves for black:
		(pawn_double_black n1 n1 n4 n2)
		(pawn_double_black n2 n2 n4 n2)
		(pawn_double_black n3 n3 n4 n2)
		(pawn_double_black n4 n4 n4 n2)
		(pawn_double_black n5 n5 n4 n2)

		;Pawn single moves for white:
		(plusOne_white n1 n2)
		(plusOne_white n2 n3)
		(plusOne_white n3 n4)
		(plusOne_white n4 n5)

		;Pawn single moves for black:
		(plusOne_black n2 n1)
		(plusOne_black n3 n2)
		(plusOne_black n4 n3)
		(plusOne_black n5 n4)
    )
    (:goal (and
        ;Adjust numbers by hand!
;[:goal_position]
        (at pawn_w3 n3 n5)
		(at pawn_w2 n2 n3)
		(at knight_w1 n3 n3)
		(at pawn_w4 n4 n3)
		(at pawn_w1 n1 n2)
		(at knight_w2 n4 n2)
		(at pawn_w5 n5 n2)
		(at rook_w1 n1 n4)
		(at king_w1 n5 n1)
		(at w_bishop_w1 n1 n5)
           )
    )
)

; plan
1. (knight_move_2rank_1file knight_w1 knight_w2 n2 n3 n1 n3)
   deleted: (at knight_w1 n2 n1)
   added: (at knight_w1 n3 n3)
   goals met: 3 of 10
2. (rook_move_vetical rook_w1 n1 n1 n1 n4)
   deleted: (at rook_w1 n1 n1)
   added: (at rook_w1 n1 n4)
   goals met: 4 of 10
3. (bishop_move w_bishop_w1 n5 n1 n1 n5)
   deleted: (at w_bishop_w1 n5 n1)
   added: (at w_bishop_w1 n1 n5)
   goals met: 5 of 10
4. (pawn_move_single_white pawn_w4 n4 n4 n2 n3)
   deleted: (at pawn_w4 n4 n2)
   added: (at pawn_w4 n4 n3)
   goals met: 6 of 10
5. (pawn_move_single_white pawn_w2 n2 n2 n2 n3)
   deleted: (at pawn_w2 n2 n2)
   added: (at pawn_w2 n2 n3)
   goals met: 7 of 10
6. (king_move king_w1 n3 n4 n1 n2)
   deleted: (at king_w1 n3 n1)
   added: (at king_w1 n4 n2)
   goals met: 7 of 10
7. (king_move king_w1 n4 n5 n2 n1)
   deleted: (at king_w1 n4 n2)
   added: (at king_w1 n5 n1)
   goals met: 8 of 10
8. (pawn_move_double_white pawn_w3 n3 n3 n2 n4)
   deleted: (at pawn_w3 n3 n2)
   added: (at pawn_w3 n3 n4)
   goals met: 8 of 10
9. (pawn_move_single_white pawn_w3 n3 n3 n4 n5)
   deleted: (at pawn_w3 n3 n4)
   added: (at pawn_w3 n3 n5)
   goals met: 9 of 10
10. (knight_move_2rank_1file knight_w2 knight_w1 n4 n5 n1 n3)
   deleted: (at knight_w2 n4 n1)
   added: (at knight_w2 n5 n3)
   goals met: 9 of 10
11. (knight_move_2file_1rank knight_w2 knight_w1 n5 n3 n3 n4)
   deleted: (at knight_w2 n5 n3)
   added: (at knight_w2 n3 n4)
   goals met: 9 of 10
12. (knight_move_2rank_1file knight_w2 knight_w1 n3 n4 n4 n2)
   deleted: (at knight_w2 n3 n4)
   added: (at knight_w2 n4 n2)
   goals met: 10 of 10
